PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
#include "satellite_app.h"

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#include "stm32wlxx_hal.h"
#include "radio.h"
#include "subghz.h"
#include "radio_board_if.h"
#include "uart/uart_debug.h"

#include "Mission/config.h"
#include "Mission/radio_app.h"
#include "Mission/protocol.h"
#include "protocol/ax25/ax25.h"
#include "protocol/g3ruh/g3ruh.h"

/*
 * ============================================================================
 * MODULE STATE & BUFFERS
 * ============================================================================
 */

const SatelliteConfig_t SatelliteDefaultConfig = SATELLITE_CONFIG_DEFAULT;
static SatelliteConfig_t s_config = SATELLITE_CONFIG_DEFAULT;

volatile uint8_t tx_busy = 0;
volatile uint8_t rx_frame_buffer[AX25_MAX_FRAME_SIZE];
volatile uint16_t rx_frame_size = 0;
volatile uint8_t rx_done_flag = 0;
volatile uint8_t rx_timeout_flag = 0;
volatile uint8_t rx_error_flag = 0;

/* Static packet buffers to guarantee zero stack overflow on Cortex-M0+ */
static uint8_t s_raw_frame[AX25_MAX_FRAME_SIZE + 64];
static uint8_t s_burst_scrambled[RADIO_FIXED_PACKET_LEN + 64];
static uint32_t s_total_packets_sent = 0;

uint32_t Satellite_GetTotalPacketsSent(void) {
    return s_total_packets_sent;
}

/* Externs from system / IT files */
extern SUBGHZ_HandleTypeDef hsubghz;
extern void SysTick_Init_CPU2(uint32_t sys_freq_hz);
extern void CPU2_Delay_Ms(uint32_t ms);
extern volatile uint32_t g_system_tick_ms;

/*
 * ============================================================================
 * INTERRUPT CALLBACKS & HARDFAULT HANDLER
 * ============================================================================
 */

void OnTxDone(void) {
    tx_busy = 0;
}

void OnTxTimeout(void) {
    uart1_puts("TX TIMEOUT ERROR\r\n");
    tx_busy = 0;
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
}

void OnRxTimeout(void) {
    rx_timeout_flag = 1;
}

void OnRxError(void) {
    rx_error_flag = 1;
}

void OnRxDone(uint8_t *payload, uint16_t size, int16_t rssi, int8_t snr) {
    (void)rssi;
    (void)snr;
    uint16_t copy_len = (size < AX25_MAX_FRAME_SIZE) ? size : AX25_MAX_FRAME_SIZE;
    memcpy((void *)rx_frame_buffer, payload, copy_len);
    rx_frame_size = copy_len;
    rx_done_flag = 1;
}

/*
 * ============================================================================
 * UTILITY & TELEMETRY FORMATTERS
 * ============================================================================
 */

static uint32_t Get_Time_Ms(void) {
    return HAL_GetTick();
}

static void Print_Hex_Bytes(const uint8_t *buf, uint16_t len) {
    char line[56];
    uint16_t pos = 0;
    uint16_t on_this_line = 0;
    for (uint16_t i = 0; i < len; i++) {
        pos += snprintf(&line[pos], sizeof(line) - pos, "%02X ", buf[i]);
        on_this_line++;
        if (on_this_line == 16 || i == (uint16_t)(len - 1)) {
            uart1_puts(line);
            uart1_puts("\r\n");
            pos = 0;
            on_this_line = 0;
        }
    }
}

static void Print_Payload_ASCII(const uint8_t *buf, uint16_t start, uint16_t end) {
    if (end <= start) {
        uart1_puts(" Payload (text) : (none)\r\n");
        return;
    }
    char line[96];
    uint16_t n = (uint16_t)(end - start);
    uint16_t max_chars = (uint16_t)(sizeof(line) - 24);
    if (n > max_chars) n = max_chars;
    uint16_t pos = 0;
    pos += (uint16_t)snprintf(&line[pos], sizeof(line) - pos, " Payload (text): \"");
    for (uint16_t i = 0; i < n; i++) {
        uint8_t c = buf[start + i];
        line[pos++] = (c >= 0x20 && c < 0x7F) ? (char)c : '.';
    }
    pos += (uint16_t)snprintf(&line[pos], sizeof(line) - pos, "\"\r\n");
    uart1_puts(line);
}

static void Print_AX25_Fields(const char *label, const uint8_t *buf, uint16_t len) {
    char line[112];
    snprintf(line, sizeof(line), " --- %s breakdown (%u bytes) ---\r\n", label, len);
    uart1_puts(line);
    if (len < 20) {
        uart1_puts(" (too short for a full AX.25 header+FCS - skipping field breakdown)\r\n");
        return;
    }
    snprintf(line, sizeof(line), "  Start Flag : 0x%02X %s\r\n", buf[0], (buf[0] == AX25_FLAG) ? "(OK)" : "(MISMATCH)");
    uart1_puts(line);
    char dest_cs[7], src_cs[7];
    AX25_DecodeAddress(&buf[1], dest_cs);
    snprintf(line, sizeof(line), "  Dest       : %s (SSID %d)\r\n", dest_cs, AX25_DecodeSSID(&buf[1]));
    uart1_puts(line);
    AX25_DecodeAddress(&buf[8], src_cs);
    snprintf(line, sizeof(line), "  Src        : %s (SSID %d)\r\n", src_cs, AX25_DecodeSSID(&buf[8]));
    uart1_puts(line);
    snprintf(line, sizeof(line), "  Control    : 0x%02X (UI-Frame)\r\n", buf[15]); uart1_puts(line);
    snprintf(line, sizeof(line), "  PID        : 0x%02X (No layer 3)\r\n", buf[16]); uart1_puts(line);

    uint16_t payload_start = 17;
    uint16_t payload_end = (uint16_t)(len - 3);
    if (payload_end > payload_start) {
        uint16_t plen = (uint16_t)(payload_end - payload_start);
        snprintf(line, sizeof(line), "  Payload    : %u bytes\r\n", plen);
        uart1_puts(line);
        Print_Hex_Bytes(&buf[payload_start], plen);
        Print_Payload_ASCII(buf, payload_start, payload_end);
    } else {
        uart1_puts("  Payload    : (none)\r\n");
    }
    if (len >= 3) {
        snprintf(line, sizeof(line), "  FCS / CRC  : 0x%02X 0x%02X\r\n", buf[len - 3], buf[len - 2]);
        uart1_puts(line);
    }
    snprintf(line, sizeof(line), "  End Flag   : 0x%02X %s\r\n", buf[len - 1], (buf[len - 1] == AX25_FLAG) ? "(OK)" : "(MISMATCH)");
    uart1_puts(line);
}

static bool Radio_Send_And_Wait(uint8_t *buffer, uint16_t size, uint32_t timeout_ms) {
    tx_busy = 1;
    RadioApp_Send(buffer, size);

    uint32_t start_ms = Get_Time_Ms();
    uint32_t max_loop = timeout_ms;
    while (tx_busy != 0) {
        if ((Get_Time_Ms() - start_ms) > timeout_ms || max_loop == 0) {
            uart1_puts("ERROR: TX timeout\r\n");
            Radio.Standby();
            tx_busy = 0;
            return false;
        }
        max_loop--;
        CPU2_Delay_Ms(1);
    }
    return true;
}

