PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
    /* 6. Core architecture & peripheral clock init */
    SystemInit();
    HAL_Init();
    SysTick_Init_CPU2(HAL_RCC_GetHCLK2Freq());

    CPU2_Delay_Ms(uart_delay); /* Allow UART line voltage to settle */

    /* 7. Structured M0+ Initialization Logs */
    uart1_puts("\r\n\r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("     STM32WL55 CORTEX-M0+ SATELLITE RADIO SYSTEM INITIALIZING         \r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("[INIT] 1. SystemCoreClock & HAL Base Initialized .......... [OK]\r\n");
    uart1_printf("[INIT] 2. CPU2 SysTick Timer Started (%lu MHz) .............. [OK]\r\n",
                 (unsigned long)(HAL_RCC_GetHCLK2Freq() / 1000000UL));
    uart1_puts("[INIT] 3. USART1 Console Initialized (PA9 TX / PA10 RX @ 115200) .. [OK]\r\n");

    RBI_Init();
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    uart1_printf("[INIT] 4. RF Front-End Switch & 3.3V PA Configured: %s (Standby: OFF) ... [OK]\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP" : "RBI_SWITCH_RFO_LP");

    MX_SUBGHZ_Init();
    HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
    __enable_irq();
    uart1_puts("[INIT] 5. Sub-GHz Radio (SX1262) & NVIC IRQs Enabled ...... [OK]\r\n");

    static RadioEvents_t s_sat_radio_events = {
        .TxDone = OnTxDone,
        .TxTimeout = OnTxTimeout,
        .RxDone = OnRxDone,
        .RxTimeout = OnRxTimeout,
        .RxError = OnRxError
    };

    RadioApp_Init(&s_config.radio, &s_sat_radio_events);
    RadioApp_SetTxPower(tx_power);
    RadioApp_SetPaSelect((s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? RFO_HP : RFO_LP);
    uart1_puts("[INIT] 6. Radio Application Layer Configured:              [OK]\r\n");
    uart1_printf("       - Downlink Frequency : %lu.%03lu MHz\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL));
    uart1_printf("       - Transmit RF Power  : +%d dBm\r\n", tx_power);
    uart1_printf("       - RF Front-End Switch: %s\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP (High Power)" : "RBI_SWITCH_RFO_LP (Low Power)");
    uart1_printf("       - GMSK Bitrate       : %lu bps (Fdev: %lu Hz, BT: 0.5)\r\n",
                 (unsigned long)bitrate, (unsigned long)fdev);
    uart1_printf("       - Callsign Profile   : %s-%d -> %s-%d\r\n",
                 s_config.radio.sourceCallsign, s_config.radio.sourceSSID,
                 s_config.radio.destCallsign, s_config.radio.destSSID);
    uart1_puts("       - Supported Modes    : 1) CW Morse Beacon (Keying)\r\n");
    uart1_puts("                              2) GMSK AX.25 UI Frame + G3RUH\r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("[INIT COMPLETE] Satellite Application Ready.\r\n");
    uart1_puts("======================================================================\r\n\r\n");
}

/*
 * ============================================================================
 * CW BEACON EXECUTION
 * ============================================================================
 */

void Satellite_Run_CW_Session_Ex(uint32_t cycle,
                                 const char *callsign,
                                 const char *msg,
                                 uint32_t unit_ms,
                                 uint32_t duration_ms,
                                 uint32_t carrier_tone_ms,
                                 uint32_t carrier_post_delay_ms,
                                 uint32_t inter_str_delay_ms,
                                 uint32_t repeat_delay_ms) {
    if (!callsign) callsign = "9NS2S2NEPAL";
    if (!msg) msg = "Namaste everyone, Testing GMSK signal ";
    if (unit_ms == 0) unit_ms = 80;
    if (duration_ms == 0) duration_ms = 60000;

    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;

    uart1_puts("\r\n============================================================\r\n");
    uart1_printf(">>> [CYCLE #%lu: STARTING CW MORSE SESSION] <<<\r\n", (unsigned long)cycle);
    uart1_printf(" Downlink Frequency : %lu.%03lu MHz | Power: +%d dBm\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL),
                 power);
    uart1_printf(" RF Switch          : %s\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP" : "RBI_SWITCH_RFO_LP");
    uart1_puts(" Modulation         : Continuous Wave (CW / Carrier Keying)\r\n");
    uart1_printf(" Morse Unit         : %lu ms\r\n", (unsigned long)unit_ms);
    uart1_printf(" Session Duration   : %lu Seconds\r\n", (unsigned long)(duration_ms / 1000));
    uart1_puts("============================================================\r\n");

    Satellite_CW_Prepare();
    uint32_t cw_start_time = Get_Time_Ms();

    /* Optional pre-beacon tuning carrier tone */
    if (carrier_tone_ms > 0) {
        uart1_printf("[CW] Emitting %lu ms continuous carrier tone...\r\n", (unsigned long)carrier_tone_ms);
        Satellite_CW_CarrierOn();
        CPU2_Delay_Ms(carrier_tone_ms);
        Satellite_CW_CarrierOff();
        if (carrier_post_delay_ms > 0) {
            CPU2_Delay_Ms(carrier_post_delay_ms);
        }
    }

    uint32_t morse_iter = 0;
    while ((Get_Time_Ms() - cw_start_time) < duration_ms) {
        morse_iter++;
        uint32_t elapsed_s = (Get_Time_Ms() - cw_start_time) / 1000;
        uart1_printf("[CW #%lu] Keying \"%s\" (Elapsed: %lu s / %lu s)\r\n",
                     (unsigned long)morse_iter, callsign, (unsigned long)elapsed_s, (unsigned long)(duration_ms / 1000));

        Satellite_CW_SendString(callsign, unit_ms);

        if (inter_str_delay_ms > 0) {
            CPU2_Delay_Ms(inter_str_delay_ms);
        }
        if ((Get_Time_Ms() - cw_start_time) >= duration_ms) break;

        uart1_printf("[CW] Keying \"%s\"\r\n", msg);
        Satellite_CW_SendString(msg, unit_ms);

